Repository: DevelopCubeLab/CustomFocusIcon
Catalog: CustomFocusIcon/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: About
zh_hans: 关于

source: Alert
zh_hans: 提示

source: Cancel
zh_hans: 取消

# CFBundleDisplayName
source: Focus icon
zh_hans: 专注图标

source: Confirm
zh_hans: 确定

# ConfirmSaveMessage
source: Are you sure you want to modify the icon?
zh_hans: 确定修改图标吗?

source: Copy
zh_hans: 复制

# CopyCommandsFooter
source: Press and hold or swipe to copy commands or path
zh_hans: 长按或滑动可复制命令或地址

# CopySFSymbol
source: Copy icon: %@
zh_hans: 已复制图标: %@

source: Demo mode
zh_hans: 演示模式

# DemoModeNotSupportedEditMessage
source: The save function is not supported in demo mode.
zh_hans: 演示模式下不支持保存

source: Dismiss
zh_hans: 关闭

source: Don't show again
zh_hans: 不再提示

source: Focus mode name
zh_hans: 专注模式名称

source: Guide
zh_hans: 教程

# GuideBackup
source: Using backup file editing guide (requires computer)
zh_hans: 使用备份编辑教程(需要电脑)

# GuideBackupContent
source: Backup Editing Guide (requires computer) You can use Windows PC or macOS to achieve this, macOS users are recommended to refer to the macOS editing tutorial, which is simpler. 1. First, create a new Focus Mode, you can also create several, which is convenient for batch modification. Encrypt the backup device using iTunes or a third-party management tool (such as: iMazing or i4 Tools or 3u Tools), please note that you must encrypt the backup, otherwise the backup will not contain the required files. 2. After the backup is complete, open the backup and find /HomeDomain/Library/DoNotDisturb/DB/ModeConfigurations.json (All commands can be directly swiped and clicked to copy below the tutorial) Copy this file to your computer. 3. (Using App Modification) Send this file to the current device, save it to the File App, find the current App's directory, then open the App's 'Manual Mode' for modification. After modification, the file will be saved to the directory you copied to, and you can copy this file back to the computer. 3. (Manual Modification) Open the copied file, use any text editor, no restrictions, search for the focus mode you just created, search for it, find the field "symbolImageName" after the name, which is something like this: "symbolImageName":"book.fill", then you just need to change this book.fill to bell.slash.fill, which is the mute icon, or the SF Symbol you want, you can find it in the SF Symbols app. Do not leave any spaces, do not change the original format "symbolImageName":"bell.slash.fill", save the file, and close the text editor. Important Tip: It is recommended to choose an SF Symbol that is compatible with all your devices, and it is recommended to choose an SF Symbol compatible with iOS 15.0 or later, otherwise when you open this SF Symbol, the low version system will not be able to display this icon normally, which will cause SpringBoard to restart indefinitely! Unless you turn off this incompatible focus mode! 4. Replace the modified file in the backup. 5. Restore the backup to the device and wait for the restore to complete. Please note that after the restore process, if "Data Restore Options" appear on the screen, please select "Do Not Transfer Apps and Data", otherwise your data may be lost. 6. Open System Settings, Focus Mode, the icon has been changed. Remember to change the name or color of this focus mode again so that iCloud can sync this focus mode. Please do not change the icon, just change the name or color. 7. Open the Focus Mode and enjoy it.
zh_hans: 使用备份编辑教程(需要电脑) 使用Windows电脑或者macOS都可以实现，macOS用户建议参考macOS的编辑教程，更简单一些。 1. 新建一个专注模式，也可以多创建几个，方便批量修改。首先使用iTunes 或者第三方管理工具（例如：iMazing或者爱思助手或3u助手）加密备份设备，请注意必须要加密备份，否则备份中将不包含所需文件 2. 等待备份完成后，打开备份并且找到 /HomeDomain/Library/DoNotDisturb/DB/ModeConfigurations.json （所有命令在教程下面可以直接滑动点击复制） 把这个文件复制到电脑上 3. （使用App修改）将这个文件发送到当前设备中，保存到文件App中，找到当前App的目录，然后打开App的’手动模式’进行修改。修改后，文件会保存到您复制到的目录下，重新复制这个文件到电脑即可。 3. （手动修改）打开复制好的文件，用文本编辑器，任何文本编辑器都行，没限制，搜索你刚才新建的那个专注模式，搜索到以后，找到名字后边的的字段“symbolImageName” 大概是这样的： "symbolImageName":"book.fill", 然后只需要修改这个book.fill,变成 bell.slash.fill ，这个就是静音图标，或者您希望的SF Symbol，可以到SF Symbols的程序中找，macOS可以下载到这个App。前后不要有空格，不要改变原始格式"symbolImageName":"bell.slash.fill”，保存文件，关闭文本编辑器 重要的提示：SF Symbol建议选择您所有设备都兼容的，建议选择最低兼容iOS 15.0的SF Symbol，否则当您打开这个SF Symbol后低版本系统无法正常显示这个icon会导致SpringBoard无限重启！除非您关闭这个不兼容的专注模式！ 4. 将修改好的文件覆盖到备份中 5. 恢复备份到设备中，等待恢复完成。请注意恢复过程后如果屏幕上出现出现“数据恢复选项”，请选择“不传输APP与数据”，否则您的数据可能会丢失 6. 打开系统设置，专注模式，图标已经被更改，记得要再给这个专注模式改下名字或颜色，这样让iCloud同步这个专注模式，请勿修改图标，改名字或者颜色就好了。 7. 打开专注模式愉快享受。

# GuideFilza
source: Use Filza edit guide (only iOS 15)
zh_hans: 使用Filza手动编辑教程(仅限iOS 15系统)

# GuideFilzaContent
source: Using Filza to Manually Edit Guide (Only for iOS 15) iOS 15 devices can use this App to edit directly. Below is the tutorial for manual modification: 1. Open System Settings, Focus Mode, create a new Focus Mode, you can also create several, which is convenient for batch modification. Then name it arbitrarily, remember this name, and choose any icon. Choose any color you like. Then turn off the settings from the background. 2. Use Filza to open: /var/mobile/Library/DoNotDisturb/DB/ModeConfigurations.json (All commands can be directly swiped and clicked to copy below the tutorial) 3. Open the copied file, use a text editor, any text editor works, no restrictions, search for the Focus Mode you just created, find the field "symbolImageName" after the name, it looks something like this: "symbolImageName":"book.fill", then you just need to change this book.fill to bell.slash.fill, which is the mute icon, or the SF Symbol you want, you can find it in the SF Symbols app. macOS can download it to this App. Do not leave any spaces, do not change the original format "symbolImageName":"bell.slash.fill", save the file, and close the text editor. Important Tip: It is recommended to choose an SF Symbol that is compatible with all your devices, and it is recommended to choose the SF Symbol compatible with the lowest iOS 15.0, otherwise, when you open this SF Symbol, the low version system cannot display this icon normally, which may cause SpringBoard to restart infinitely! Unless you turn off this incompatible Focus Mode! 4. Save the current file 5. Restart or restart the user space. Do not change the Focus Mode in the settings before restarting, otherwise the previous modifications may be overwritten. 6. Open System Settings, Focus Mode, the icon has been changed. Remember to change the name or color of this Focus Mode again so that iCloud can sync this Focus Mode. Do not change the icon, just change the name or color. 7. Open Focus Mode and enjoy it.
zh_hans: 使用Filza手动编辑教程(仅限iOS 15系统) iOS 15 设备可以使用此App直接编辑，下面是手动修改的教程： 1. 打开系统设置，专注模式，新建一个专注模式，也可以多创建几个，方便批量修改。然后随便起名字，要记住这个名字，图标随便选。颜色您喜欢什么颜色就用什么颜色。然后从后台关闭设置。 2. 使用Filza打开： /var/mobile/Library/DoNotDisturb/DB/ModeConfigurations.json （所有命令在教程下面可以直接滑动点击复制） 3.打开复制好的文件，用文本编辑器，任何文本编辑器都行，没限制，搜索你刚才新建的那个专注模式，搜索到以后，找到名字后边的的字段“symbolImageName” 大概是这样的： "symbolImageName":"book.fill", 然后只需要修改这个book.fill,变成 bell.slash.fill ，这个就是静音图标，或者您希望的SF Symbol，可以到SF Symbols的程序中找，macOS可以下载到这个App。前后不要有空格，不要改变原始格式"symbolImageName":"bell.slash.fill”，保存文件，关闭文本编辑器 重要的提示：SF Symbol建议选择您所有设备都兼容的，建议选择最低兼容iOS 15.0的SF Symbol，否则当您打开这个SF Symbol后低版本系统无法正常显示这个icon会导致SpringBoard无限重启！除非您关闭这个不兼容的专注模式！ 4. 保存当前文件 5.重启或者重新启动用户空间，在重启之前请勿到设置中更改专注模式，否则之前的修改可能会被覆盖 6.打开系统设置，专注模式，图标已经被更改，记得要再给这个专注模式改下名字或颜色，这样让iCloud同步这个专注模式，请勿修改图标，改名字或者颜色就好了。 7. 打开专注模式愉快享受。

# GuideMacOS
source: macOS editing guide (requires a Mac)
zh_hans: 使用macOS编辑教程(需要搭载macOS的电脑)

# GuideMacOSContent
source: macOS Editing Guide (requires macOS) Firstly, make sure that the computer and phone are using the same iCloud account, this is very important! 1. Open the computer's settings, Focus Mode, create a new Focus Mode, you can also create several, which is convenient for batch modification. Then name it arbitrarily, remember this name, and choose any icon. Choose the color you like. Then close the settings, Command + Q 2. Open Mac's Finder Command + Shift + G to bring up the address bar, paste this address ~/Library/DoNotDisturb/DB/ModeConfigurations.json (All commands can be directly swiped and clicked to copy below the tutorial) Make a copy of this file, copy it to the desktop or the download folder, you must copy it, otherwise you will be prompted that the file is locked 3. (Using App to Modify) Send this file to the current device, save it to the Files App, find the current App's directory, then open the App's 'Manual Mode' for modification. After modification, the file will be saved to the directory you copied to, and then copy this file back to the computer. 3. (Manual Modification) Open the copied file, use a text editor, any text editor is fine, no restrictions, search for the focus mode you just created, after searching, find the field "symbolImageName" after the name, it looks something like this: "symbolImageName":"book.fill", then you just need to change "book.fill" to "bell.slash.fill", this is the mute icon, or the SF Symbol you want, you can find it in the SF Symbols app. Do not leave any spaces, do not change the original format "symbolImageName":"bell.slash.fill", save the file, and close the text editor Important Tip: It is recommended to choose an SF Symbol that is compatible with all your devices, and it is recommended to choose an SF Symbol compatible with iOS 15.0 or later, otherwise, when you open this SF Symbol, the low version system will not be able to display this icon normally, which will cause SpringBoard to restart indefinitely! Unless you turn off this incompatible Focus Mode! 4. Copy the file back to ~/Library/DoNotDisturb/DB/and overwrite it 5. Restart the computer, this step is very important, otherwise the system will not reload the Focus Mode 6. After restarting, open the computer settings, Focus Mode, the icon has changed, remember to change the name or color of this Focus Mode again, so that iCloud can synchronize this Focus Mode, please do not change the icon, just change the name or color. 7. Wait for iCloud to synchronize to the phone and iPad, open the focus mode and enjoy it happily.
zh_hans: 使用macOS编辑教程(需要搭载macOS的电脑) 首先保证电脑和手机用的是一个iCloud账户，这个很重要！ 1.打开电脑的设置，专注模式，新建一个专注模式，也可以多创建几个，方便批量修改。然后随便起名字，要记住这个名字，图标随便选。颜色您喜欢什么颜色就用什么颜色。然后关闭设置，Command + Q 2. 打开Mac的Finder Command + Shift + G 出现地址栏，粘贴这个地址 ~/Library/DoNotDisturb/DB/ModeConfigurations.json （所有命令在教程下面可以直接滑动点击复制） 把这个文件复制一份，复制到桌面或者下载文件夹都行，一定要复制，否则会提示文件已锁定 3. （使用App修改）将这个文件发送到当前设备中，保存到文件App中，找到当前App的目录，然后打开App的’手动模式’进行修改。修改后，文件会保存到您复制到的目录下，重新复制这个文件到电脑即可。 3. （手动修改）打开复制好的文件，用文本编辑器，任何文本编辑器都行，没限制，搜索你刚才新建的那个专注模式，搜索到以后，找到名字后边的的字段“symbolImageName” 大概是这样的： "symbolImageName":"book.fill", 然后只需要修改这个book.fill,变成 bell.slash.fill ，这个就是静音图标，或者您希望的SF Symbol，可以到SF Symbols的程序中找，macOS可以下载到这个App。前后不要有空格，不要改变原始格式"symbolImageName":"bell.slash.fill”，保存文件，关闭文本编辑器 重要的提示：SF Symbol建议选择您所有设备都兼容的，建议选择最低兼容iOS 15.0的SF Symbol，否则当您打开这个SF Symbol后低版本系统无法正常显示这个icon会导致SpringBoard无限重启！除非您关闭这个不兼容的专注模式！ 4. 把文件复制回~/Library/DoNotDisturb/DB/并且进行覆盖 5. 重启电脑，这一步很重要，不然系统不会重新加载专注模式 6. 重启后，打开电脑设置，专注模式，图标已经变了，记得要再给这个专注模式改下名字或颜色，这样让iCloud同步这个专注模式，请勿修改图标，改名字或者颜色就好了。 7. 等待iCloud同步到手机和iPad上，打开专注模式愉快享受。

# GuideManual
source: iOS 16 or above version (requires jailbreak)
zh_hans: iOS 16或以上版本系统(需要越狱)

# GuideManualContent
source: iOS 16 or above version (requires jailbreak) modification guide Due to the fact that the configuration file directory has been protected by the system starting from iOS 16.0 version, you cannot directly use this App or Filza to edit it. You need to use SSH or Terminal commands to achieve this. 1. First, make sure your device is jailbroken and has SSH and NewTerm installed, and you know the current root password. Create a new focus mode, you can also create several, which is convenient for batch modification. 2. It is recommended to try using NewTerm on the iOS device first, In NewTerm, input su Then press the Enter key, input the root password, and press Enter Skip directly to step 4 3. If step 2 fails, you can only use the SSH command to operate. The computer and phone are on the same Wi-Fi, open Terminal on the computer and input %@ (All commands can be directly swiped and clicked to copy below the tutorial) Press the Enter key and input your root password 4. Copy the following command to copy the configuration file to the current App %@ If you cannot copy on the iOS device, a prompt of no permission will appear, then you need to jump to step 3 and use SSH to solve it. Copy the following command to change file permissions %@ 5. Open the App's settings and enable 'Manual Mode' 6. Use the App's built-in editor to edit the icon of the focus mode you want 7. Use the following command to copy the configuration file to the original directory %@ Copy the following command to change file permissions %@ 8. Restart or reboot the user space. Do not change the focus mode in the settings before restarting, otherwise the previous modifications may be overwritten 9. Open system settings, focus mode, the icon has been changed. Remember to change the name or color of this focus mode so that iCloud can sync this focus mode. Please do not change the icon, just change the name or color. 10. Open the focus mode and enjoy it.
zh_hans: iOS 16或以上版本系统(需要越狱)修改教程 由于配置文件目录从iOS 16.0版本开始，被系统保护了，因此您无法直接使用此App或者Filza进行编辑。需要使用SSH或者Terminal命令来实现 1. 首先确保您的设备已经越狱并且安装了SSH和NewTerm，并且您已经知道当前的root密码。新建一个专注模式，也可以多创建几个，方便批量修改。 2. 建议先在iOS设备上尝试使用NewTerm进行尝试， 在NewTerm输入 su 然后按下换行按钮（回车），输入root密码，回车 请直接到步骤4 3. 如果步骤2失败，只能使用SSH命令进行操作。电脑和手机在同一个Wi-Fi下，电脑打开Terminal 输入 %@ （所有命令在教程下面可以直接滑动点击复制） 并按下换行按钮，并且输入您的root密码 4. 复制下列命令将配置文件复制到当前App中 %@ 如果在iOS设备上无法复制，提示无权限，则需要跳转到步骤3使用SSH来解决。 复制下列命令更改文件权限 %@ 5. 打开App的设置，启用’手动模式’ 6. 使用App内编辑器编辑您想要的专注模式icon 7.使用下列命令将配置文件复制到原始目录下 %@ 复制下列命令更改文件权限 %@ 8.重启或者重新启动用户空间，在重启之前请勿到设置中更改专注模式，否则之前的修改可能会被覆盖 9.打开系统设置，专注模式，图标已经被更改，记得要再给这个专注模式改下名字或颜色，这样让iCloud同步这个专注模式，请勿修改图标，改名字或者颜色就好了。 10. 打开专注模式愉快享受。

source: Home
zh_hans: 主页

source: Icon SF Symbol name
zh_hans: 图标SF symbol名称

source: Important tips
zh_hans: 重要提示

# ImportantTipsMessage
source: SF Symbol recommends selecting an SF Symbol that is compatible with all your devices and has a minimum compatibility of iOS 15.0. Otherwise, when you open this SF Symbol, the icon will not display properly on lower version systems, which may cause the SpringBoard to restart indefinitely! Unless you disable this incompatible focus mode!
zh_hans: SF Symbol建议选择您所有设备都兼容的，最低兼容iOS 15.0的SF Symbol，否则当您打开这个SF Symbol后低版本系统无法正常显示这个icon会导致SpringBoard无限重启！除非您关闭这个不兼容的专注模式！

# InvalidSFSymbolMessage
source: The SF Symbol you entered is invalid, it cannot be saved, please modify the SF Symbol or select a SF Symbol from the recommended list.
zh_hans: 您输入的SF Symbol无效，无法保存，请修改SF Symbol或从推荐列表中选择SF Symbol

source: Manual mode
zh_hans: 手动模式

# ManualModeCopyFileFooter
source: Please copy the 'ModeConfigurations.json' to the App directory within the File App or '%@'
zh_hans: 请将'ModeConfigurations.json'文件复制到文件App中的App目录或'%@'

source: Mode
zh_hans: 模式

# ModeNameTextFooter
source: Focus mode name and color can be changed in system settings
zh_hans: 专注模式名称、颜色可在系统设置中更改

# ModifySuccessfulWithManual
source: The modification was successful, please continue to refer to the contents of the tutorial for further operation. The original file has been backed up at: %@
zh_hans: 修改成功，请继续参考教程中的内容继续操作 原始文件已备份在: %@

# ModifySuccessfulWithRoot
source: Jailbreak devices can take effect after restarting user space. If you need to synchronize to other devices in your iCloud account, please restart the device/restart user space and then add or modify a focus mode name in the focus mode settings under system settings to trigger synchronization. The original file has been backed up at: %@
zh_hans: 修改成功，请重启设备后生效 越狱设备可以重启用户空间后生效，如需要同步到iCloud账户中的其他设备中，请重启设备/重启用户空间后在系统设置中专注模式中随意添加或修改一个专注模式的名称即可触发同步。 原始文件已备份在: %@

# NoPermissionFooter
source: Current permissions are not available, please go to settings to view the tutorial or switch to a different mode.
zh_hans: 当前无权限，请切换至设置中查看教程或切换模式

# NotSupportedSFSymbolMessage
source: The input SF Symbol is invalid.
zh_hans: 输入的SF Symbol无效

# NotSupportFooter
source: iOS 15.0 and below not support Focus Mode.
zh_hans: iOS 15.0以下系统不支持专注模式

source: Paste
zh_hans: 粘贴

source: Preview icon
zh_hans: 图标预览

source: Reboot
zh_hans: 重启设备

source: Recommend icon
zh_hans: 推荐图标

# RequiredCommands
source: Required commands or path
zh_hans: 所需要的命令或目录地址

source: Reset alert
zh_hans: 重设警告

# RunWithiOS14Message
source: iOS 15.0 or below does not support focus mode
zh_hans: iOS 15.0以下版本不支持专注模式

# RunWithiOS16RootMessage
source: Starting with iOS 16.0, the configuration profile directory of Focus Mode has been protected by the system and cannot be directly modified. Please refer to the contents of the tutorial for operation.
zh_hans: iOS 16.0开始，专注模式的配置文件目录已经被系统保护，无法使用直接进行修改，请参考教程中的内容进行操作

# RunWithManualModeMessage
source: Currently in manual mode, please note that after saving the file, continue to follow the tutorial to complete the modification.
zh_hans: 当前为手动模式，请注意保存文件后，继续参考教程完成修改

# RunWithNoPermissionMessage
source: Your installation method cannot obtain more permissions, please try enabling demonstration mode or refer to the tutorial to use other methods for modification.
zh_hans: 您的安装方式无法获取更多权限，请尝试开启演示模式或参考教程使用其它方法进行修改

source: Save
zh_hans: 保存

source: Settings
zh_hans: 设置

source: SF Symbol Reference
zh_hans: SF Symbol参考

source: SF Symbols Preview
zh_hans: SF Symbols 预览

# SFSymbolTextFooter
source: Do not use SF Symbol that is not supported by low iOS versions, otherwise enabling focus mode, it will cause SpringBoard to restart infinitely!
zh_hans: 请勿使用低iOS系统版本不支持的SF Symbol，否则开启专注模式后，会导致SpringBoard无限重启！

# TestIcon
source: Test and show icon
zh_hans: 测试图标

# TipsContent
source: Please place your 'ModeConfigurations.json' in this directory
zh_hans: 请将您的'ModeConfigurations.json'放置在此目录下

# TipsFileName
source: Tips.txt
zh_hans: 提示.txt

source: Unknown
zh_hans: 未知

source: Version
zh_hans: 版本

# WorkAtRootHomeFooter
source: Click + to jump to settings to add focus mode
zh_hans: 点击+可跳转到设置中添加专注模式

source: Work mode: %@
zh_hans: 工作模式： %@
